{
    "data": [
      {
        "title": "Preposisi",
        "description": "Course 9/10",
        "imageUrl": "assets/img/model_1.png",
        "progress": 0.7,
        "courses": [
          {
            "title": "Quando usar relativas",
            "category": "Preposisi",
            "description": "Neste curso, você aprenderá como usar as orações relativas em Português. As orações relativas são usadas para ligar frases e formar sentenças mais complexas. Elas são introduzidas por pronomes relativos como que, o qual, a qual, os quais, as quais, onde, quando, por que, como, entre outros.",
            "image": "assets/img/model_3.png",
            "difficulity": "A1.2",
            "time": "10 min"
          },
          {
            "title": "Quando usar o Pretérito Perfeito",
            "category": "Preposisi",
            "description": "O Português geralmente usa o pretérito perfeito para falar sobre eventos passados, assim como o inglês. O pretérito perfeito refere-se a uma ação que ocorreu em algum momento do passado e ainda está em andamento.",
            "image": "assets/img/model_3.png",
            "difficulity": "A1.2",
            "time": "10 min"
          },
          {
            "title": "Como usar o Acusativo e Dativo",
            "category": "Preposisi",
            "description": "O Português utiliza o caso acusativo para indicar o objeto direto de uma frase. O objeto direto é a pessoa ou coisa que recebe a ação expressa pelo verbo. O caso acusativo também é usado após certas preposições, como por, para, contra, sem, a, entre outras.",
            "image": "assets/img/model_3.png",
            "difficulity": "A1.2",
            "time": "10 min"
          },
          {
            "title": "Verbos Modais",
            "category": "Preposisi",
            "description": "Para tornar uma frase negativa em Português, você geralmente usa a palavra não. No entanto, ao usar um verbo modal, a palavra não é colocada após o verbo modal e não no final da frase.",
            "image": "assets/img/model_3.png",
            "difficulity": "A1.2",
            "time": "10 min"
          },
          {
            "title": "Palavras Interrogativas",
            "category": "Preposisi",
            "description": "Você sabe como fazer perguntas em Português? Neste curso, você aprenderá como usar as palavras interrogativas em Português. As palavras interrogativas são usadas para fazer perguntas como o quê, onde, quando, por quê, como, entre outras. Elas também são chamadas de pronomes interrogativos.",
            "image": "assets/img/model_3.png",
            "difficulity": "A1.2",
            "time": "10 min"
          }
        ]
      },
      {
        "title": "Noun",
        "description": "Course 10/10",
        "imageUrl": "assets/img/model_1.png",
        "progress": 0.8,
        "courses": [
          {
            "title": "Introduction to Noun",
            "category": "Noun",
            "description": "In Portuguese, nouns are words that refer to people, places, things, or ideas. They can be used with articles (a, an, the) or without articles. In this course, you will learn about the different types of nouns in Portuguese and how to use them in sentences.",
            "image": "assets/img/model_3.png",
            "difficulity": "A1.2",
            "time": "12 min"
          },
          {
            "title": "Common Nouns",
            "category": "Noun",
            "description": "There are two types of common nouns in Portuguese: countable and uncountable. Countable nouns refer to things that can be counted, such as a book, a cat, or a house. Uncountable nouns refer to things that cannot be counted, such as water, air, or love.",
            "image": "assets/img/model_3.png",
            "difficulity": "A1.2",
            "time": "10 min"
          },
          {
            "title": "Noun Gender",
            "category": "Noun",
            "description": "Gender in Portuguese is a grammatical category that indicates whether a noun is masculine or feminine. In this course, you will learn about the different types of nouns in Portuguese and how to use them in sentences.",
            "image": "assets/img/model_3.png",
            "difficulity": "A1.2",
            "time": "15 min"
          }
        ]
      },
      {
        "title": "Verbs",
        "description": "Course 11/10",
        "imageUrl": "assets/img/model_2.png",
        "progress": 0.9,
        "courses": [
          {
            "title": "Introduction to Verbs",
            "category": "Verbs",
            "description": "We can say in Portuguese that a verb is a word that expresses an action, an event, or a state of being. In this course, you will learn about the different types of verbs in Portuguese and how to use them in sentences.",
            "image": "assets/img/model_2.png",
            "difficulity": "A2.1",
            "time": "15 min"
          },
          {
            "title": "Irregular Verbs",
            "category": "Verbs",
            "description": "Irregular verbs are verbs that do not follow the regular conjugation patterns of the language. For example, the verb to be is irregular in English because it does not follow the pattern of adding -ed to form the past tense. In this course, you will learn about the different types of irregular verbs in Portuguese and how to use them in sentences.",
            "image": "assets/img/model_3.png",
            "difficulity": "A2.2",
            "time": "12 min"
          },
          {
            "title": "Modal Verbs",
            "category": "Verbs",
            "description": "We can say 'Obrigado' in Portuguese that a modal verb is a type of auxiliary verb that expresses modality. In this course, you will learn about the different types of modal verbs in Portuguese and how to use them in sentences.",
            "image": "assets/img/model_3.png",
            "difficulity": "B1.1",
            "time": "18 min"
          }
        ]
      },
      {
        "title": "Sentences",
        "description": "Course 12/10",
        "imageUrl": "assets/img/model_3.png",
        "progress": 1.0,
        "courses": [
          {
            "title": "Building Sentences",
            "category": "Sentences",
            "description": "Sentence in Portuguese for example ' Eu gosto de estudar Português' is a group of words that expresses a complete thought. In this course, you will learn about the different types of sentences in Portuguese and how to use them in sentences.",
            "image": "assets/img/model_2.png",
            "difficulity": "B1.1",
            "time": "18 min"
          },
          {
            "title": "Complex Sentences",
            "category": "Sentences",
            "description": "A complex sentence is a sentence that contains an independent clause and one or more dependent clauses. In this course, you will learn about the different types of complex sentences in Portuguese and how to use them in sentences.",
            "image": "assets/img/model_1.png",
            "difficulity": "B2.1",
            "time": "20 min"
          },
          {
            "title": "Sentence Types",
            "category": "Sentences",
            "description": "In Roman Language Portuguese, there are four types of sentences: declarative, interrogative, imperative, and exclamatory. In this course, you will learn about the different types of sentences in Portuguese and how to use them in sentences.",
            "image": "assets/img/model_1.png",
            "difficulity": "B2.2",
            "time": "15 min"
          }
        ]
    }
    ]
  }
  